app/controllers/top_controller.rb

SELECT "brand_sizes".* FROM "brand_sizes" WHERE ((name like '%%' or name_kana like '%%') and size_japan = 'S')
---
    else
      @select_size_XS = true
    end
    @brand_size = BrandSize.where("(name like ? or name_kana like ?) and size_japan = ?",'%'+@brand_input+'%','%'+@brand_input+'%',@japan_size_select)